In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
plt.rcParams['font.family']='Malgun Gothic'

In [ ]:
birthDF = pd.read_csv('data/births.csv', index_col='year')
# birthDF.columns = birthDF.columns.str.strip()
# birthDF.index = birthDF.index.str.strip()
birthDF

         boys    girls
year
1880    90993   110491
1881    91954   100745
1882   107850   113688
1883   112321   104629
1884   129022   114445
...       ...      ...
2007  1919408  2072139
2008  1887234  2036289
2009  1832925  1979303
2010  1772738  1913851
2011  1753500  1893230

[132 rows x 2 columns]

In [3]:
# 01. 남아 ,여아 출생 평균을 구하시요
birthDF.mean().round(2)

boys     1225776.07
girls    1245399.21
dtype: float64

2. 남아 수가 평균보다 많은 연도만 출력하시오.

In [7]:
birthDF[ birthDF[' boys']> birthDF[' boys'].mean()].index

Index([1921, 1924, 1942, 1943, 1944, 1945, 1946, 1947, 1948, 1949, 1950, 1951,
       1952, 1953, 1954, 1955, 1956, 1957, 1958, 1959, 1960, 1961, 1962, 1963,
       1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971, 1972, 1973, 1974, 1975,
       1976, 1977, 1978, 1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999,
       2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011],
      dtype='int64', name='year')

3. 남아출생이 가장많은 top5를 구하시요(년도와 남아수)

In [10]:
birthDF.nlargest(5, ' boys', keep='all')[[' boys']]

         boys
year
1957  2044160
1959  2023044
1960  2022093
1961  2017316
1958  2010884

4. 남아율(%)를 구하고 각년도별 남아수가 차지하는 비율 칼럼을 추가하시오

In [12]:
birthDF['male_ratio'] = birthDF[' boys'] / (birthDF[' boys'] + birthDF[' girls']) * 100
birthDF

         boys    girls  male_ratio
year
1880    90993   110491   45.161402
1881    91954   100745   47.718981
1882   107850   113688   48.682393
1883   112321   104629   51.772759
1884   129022   114445   52.993630
...       ...      ...         ...
2007  1919408  2072139   48.086819
2008  1887234  2036289   48.100495
2009  1832925  1979303   48.080152
2010  1772738  1913851   48.086131
2011  1753500  1893230   48.084174

[132 rows x 3 columns]

# 05. 2000년도 이후데이터 에 대해 출생량 을 구하고 남아수가 1800000 이상이면 '많음'아니면 '적음' 이라고 보여 주시요(결과는 데이터프레임)
# 년도 	남아수 출생량
# ----------------------
# 2000   1233   '많음'
# 2001   1234   '적음'

In [30]:
y2000 = birthDF.loc[2000:, [' boys'] ]
y2000.index.name = '년도'
y2000.rename( columns={' boys':'남아수'},inplace=True)
y2000
# y2000['출생량'] = y2000[' boys'].apply( lambda v:'많음' if v>=1800000 else '적음' )
# y2000

          남아수
년도
2000  1814601
2001  1799049
2002  1795206
2003  1825359
2004  1834145
2005  1845379
2006  1898463
2007  1919408
2008  1887234
2009  1832925
2010  1772738
2011  1753500


birthDF5 = birthDF[birthDF.index>=2000][' boys']
rst = birthDF5.apply(lambda v: '많음' if v>=1800000 else '적음')
rst5 = pd.DataFrame({'남아수': birthDF5.values, '출생량': rst.values}, index=birthDF5.index)
print(rst5)